---
kind: method
id: M:Autodesk.Revit.DB.OBJExportOptions.IsValidForMaxEdgeLength(System.Double)
source: html/ffc983cc-bc1f-33fa-9826-9680b6a70ed2.htm
---
# Autodesk.Revit.DB.OBJExportOptions.IsValidForMaxEdgeLength Method

Checks whether the value is allowed (is in the allowed range) for MaxEdgeLength tessellation parameter.

## Syntax (C#)
```csharp
public static bool IsValidForMaxEdgeLength(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The value to be checked.

## Returns
True if the value is valid for MaxEdgeLength, false otherwise.